function morseCodeEncoder(text) {
    const morseCodeMap = {
      A: '.-',
      B: '-...',
      C: '-.-.',
      D: '-..',
      E: '.',
      F: '..-.',
      G: '--.',
      H: '....',
      I: '..',
      J: '.---',
      K: '-.-',
      L: '.-..',
      M: '--',
      N: '-.',
      O: '---',
      P: '.--.',
      Q: '--.-',
      R: '.-.',
      S: '...',
      T: '-',
      U: '..-',
      V: '...-',
      W: '.--',
      X: '-..-',
      Y: '-.--',
      Z: '--..',
      '1': '.----',
      '2': '..---',
      '3': '...--',
      '4': '....-',
      '5': '.....',
      '6': '-....',
      '7': '--...',
      '8': '---..',
      '9': '----.',
      '0': '-----',
      '.': '.-.-.-',
      ',': '--..--',
      '?': '..--..',
      "'": '.----.',
      '!': '-.-.--',
      '/': '-..-.',
      '(': '-.--.',
      ')': '-.--.-',
      '&': '.-...',
      ':': '---...',
      ';': '-.-.-.',
      '=': '-...-',
      '+': '.-.-.',
      '-': '-....-',
      _: '..--.-',
      '"': '.-..-.',
      $: '...-..-',
      '@': '.--.-.',
      Å: '.-.-',
      Ä: '.--.-',
      É: '..-..',
      Ñ: '--.--',
      Ö: '---.',
      Ü: '..--',
      a: '.-',
      b: '-...',
      c: '-.-.',
      d: '-..',
      e: '.',
      f: '..-.',
      g: '--.',
      h: '....',
      i: '..',
      j: '.---',
      k: '-.-',
      l: '.-..',
      m: '--',
      n: '-.',
      o: '---',
      p: '.--.',
      q: '--.-',
      r: '.-.',
      s: '...',
      t: '-',
      u: '..-',
      v: '...-',
      w: '.--',
      x: '-..-',
      y: '-.--',
      z: '--..',
    };
  
    const encodedChars = Array.from(text.toUpperCase())
      .map(char => {
        const encodedChar = morseCodeMap[char] || '';
        console.log(`Encoded char: ${encodedChar}`);
        return encodedChar;
      })
      .join('/');
  
    console.log(`Encoded message: ${encodedChars}`);
  
    return encodedChars;
  }
  
  const text = 'HELLOWORLD';
  const morseCode = morseCodeEncoder(text);
  console.log(morseCode);
  